In [1]:
import pandas as pd
import numpy as np

In [2]:
df= pd.read_csv("data/polluted_countries.csv")

In [3]:
df.head(5)

   Unnamed: 0  Rank Country/Region  Population  Year  Pollution
0           0     1     Bangladesh   164689383  2021       76.9
1           1     2           Chad    16425859  2021       75.9
2           2     3       Pakistan   220892331  2021       66.8
3           3     4     Tajikistan     9537642  2021       59.4
4           4     5          India  1380004385  2021       58.1

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 472 entries, 0 to 471
Data columns (total 6 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Unnamed: 0      472 non-null    int64
 1   Rank            472 non-null    int64
 2   Country/Region  472 non-null    object
 3   Population      472 non-null    int64
 4   Year            472 non-null    int64
 5   Pollution       472 non-null    float64
dtypes: float64(1), int64(4), object(1)
memory usage: 22.2+ KB

In [5]:
df1= df.melt(id_vars=["Rank","Country/Region", "Population"],
           var_name= "Year",
           value_name= "Pollution")

/var/folders/8l/zm2f15815wb7zxjgwnj0zkjh0000gn/T/ipykernel_1339/3495385129.py:1: FutureWarning: This dataframe has a column name that matches the 'value_name' column name of the resulting Dataframe. In the future this will raise an error, please set the 'value_name' parameter of DataFrame.melt to a unique name.
  df1= df.melt(id_vars=["Rank","Country/Region", "Population"],

In [22]:
df1.head(5)

   Rank Country/Region  Population  Year  Pollution
0     1     Bangladesh   164689383  2021       76.9
1     2           Chad    16425859  2021       75.9
2     3       Pakistan   220892331  2021       66.8
3     4     Tajikistan     9537642  2021       59.4
4     5          India  1380004385  2021       58.1

In [23]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 472 entries, 0 to 471
Data columns (total 5 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Rank            472 non-null    int64
 1   Country/Region  472 non-null    object
 2   Population      472 non-null    int64
 3   Year            472 non-null    object
 4   Pollution       472 non-null    float64
dtypes: float64(1), int64(2), object(2)
memory usage: 18.6+ KB

In [24]:
#Pa√≠ses contaminados definitivo
df1.to_csv('polluted_countries.csv')

In [6]:
df2= pd.read_csv("data/polluted_cities.csv")
df2.head(10)

   Unnamed: 0  Rank        City    country  Date  Pollution
0           0     1     bhiwadi      india  2021      106.2
1           1     2   ghaziabad      india  2021      102.0
2           2     3       hotan      china  2021      101.5
3           3     4       delhi      india  2021       96.4
4           4     5     jaunpur      india  2021       95.3
5           5     6  faisalabad   pakistan  2021       94.2
6           6     7       noida      india  2021       91.4
7           7     8  bahawalpur   pakistan  2021       91.0
8           8     9    peshawar   pakistan  2021       89.6
9           9    10      bagpat      india  2021       89.1

In [8]:
df3= df2["City"], df2["country"], df2["JAN(2021)"], df2["FEB(2021)"], df2["MAR(2021)"], df2["APR(2021)"], df2["MAY(2021)"], df2["JUN(2021)"], df2["JUL(2021)"], df2["AUG(2021)"], df2["SEP(2021)"],df2["OCT(2021)"],df2["NOV(2021)"],df2["DEC(2021)"]

In [ ]:
df3= pd.DataFrame(df3).T
df3

In [54]:
df3.columns= ["City", "Country","01/2021","02/2021","03/2021","04/2021","05/2021","06/2021","07/2021","08/2021","09/2021","10/2021","11/2021","12/2021"]

In [55]:
df3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6475 entries, 0 to 6474
Data columns (total 14 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   City     6474 non-null   object
 1   Country  6475 non-null   object
 2   01/2021  6475 non-null   object
 3   02/2021  6475 non-null   object
 4   03/2021  6475 non-null   object
 5   04/2021  6475 non-null   object
 6   05/2021  6475 non-null   object
 7   06/2021  6475 non-null   object
 8   07/2021  6475 non-null   object
 9   08/2021  6475 non-null   object
 10  09/2021  6475 non-null   object
 11  10/2021  6475 non-null   object
 12  11/2021  6475 non-null   object
 13  12/2021  6475 non-null   object
dtypes: object(14)
memory usage: 708.3+ KB

In [58]:
df4= df3.melt(id_vars=["City","Country"],
           var_name= "Date",
           value_name= "Pollution")

In [59]:
df4.head(5)

        City Country     Date Pollution
0    bhiwadi   india  01/2021     145.8
1  ghaziabad   india  01/2021     199.9
2      hotan   china  01/2021       0.0
3      delhi   india  01/2021     183.7
4    jaunpur   india  01/2021     182.2

In [60]:
#Ciudades en a√±o 2021 definitivo
df4.to_csv('polluted_cities_21.csv')

In [74]:
del(df2["JAN(2021)"], df2["FEB(2021)"], df2["MAR(2021)"], df2["APR(2021)"], df2["MAY(2021)"], df2["JUN(2021)"], df2["JUL(2021)"], df2["AUG(2021)"], df2["SEP(2021)"],df2["OCT(2021)"],df2["NOV(2021)"],df2["DEC(2021)"])

In [76]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6475 entries, 0 to 6474
Data columns (total 8 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Rank     6475 non-null   int64
 1   City     6474 non-null   object
 2   2021     6475 non-null   float64
 3   2020     6475 non-null   float64
 4   2019     6475 non-null   float64
 5   2018     6475 non-null   float64
 6   2017     6475 non-null   float64
 7   country  6475 non-null   object
dtypes: float64(5), int64(1), object(2)
memory usage: 404.8+ KB

In [77]:
df2= df2.melt(id_vars=["Rank","City", "country"],
           var_name= "Date",
           value_name= "Pollution")

In [82]:
#df2.info()
#df2.head(5)

In [83]:
#Ciudades definitivo
df2.to_csv('polluted_cities.csv')

In [85]:
df5= pd.read_csv("data/birthrate.csv")
df5.head(5)

,Unnamed: 0,country,year,born,male_born,female_born,birth_rate,fertility_rate,variation
0,0,Spain,2017,393181.0,202478.0,190703.0,841.0,1.31,-1.92
1,1,Germany,2017,784901.0,402517.0,382384.0,950.0,1.57,-1.88
2,2,United Kingdom,2017,754754.0,387030.0,367724.0,1140.0,1.74,-2.79
3,3,France,2017,770045.0,394058.0,375987.0,1150.0,1.89,-1.56
4,4,Italy,2017,458151.0,235733.0,222418.0,760.0,1.32,-1.49

In [86]:
df5["birth_rate"]= df5["birth_rate"]/100

In [87]:
df5.head(5)

,Unnamed: 0,country,year,born,male_born,female_born,birth_rate,fertility_rate,variation
0,0,Spain,2017,393181.0,202478.0,190703.0,8.41,1.31,-1.92
1,1,Germany,2017,784901.0,402517.0,382384.0,9.50,1.57,-1.88
2,2,United Kingdom,2017,754754.0,387030.0,367724.0,11.40,1.74,-2.79
3,3,France,2017,770045.0,394058.0,375987.0,11.50,1.89,-1.56
4,4,Italy,2017,458151.0,235733.0,222418.0,7.60,1.32,-1.49

In [88]:
df5.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 965 entries, 0 to 964
Data columns (total 9 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Unnamed: 0      965 non-null    int64
 1   country         965 non-null    object
 2   year            965 non-null    int64
 3   born            965 non-null    float64
 4   male_born       965 non-null    float64
 5   female_born     965 non-null    float64
 6   birth_rate      965 non-null    float64
 7   fertility_rate  965 non-null    float64
 8   variation       965 non-null    float64
dtypes: float64(6), int64(2), object(1)
memory usage: 68.0+ KB

In [89]:
df5.to_csv('birthrate.csv')

### Poner en mayusc

In [9]:
df6= pd.read_csv("data/polluted_cities_21.csv")

In [11]:
df6.Country= df6.Country.str.title()

In [13]:
df6.City= df6.City.str.title()

In [14]:
df6.head(5)

   Unnamed: 0       City Country     Date  Pollution
0           0    Bhiwadi   India  01/2021      145.8
1           1  Ghaziabad   India  01/2021      199.9
2           2      Hotan   China  01/2021        0.0
3           3      Delhi   India  01/2021      183.7
4           4    Jaunpur   India  01/2021      182.2

In [15]:
df6.to_csv('polluted_cities_21.csv')

In [16]:
df7= pd.read_csv("data/cost_living.csv")

In [20]:
df7.head(5)

   Unnamed: 0    countries  cost_living_index  year
0           0      Bermuda              146.2  2017
1           1  Switzerland              122.1  2017
2           2      Iceland              111.7  2017
3           3       Norway              106.3  2017
4           4      Bahamas              104.0  2017

In [19]:
df7.countries= df7.countries.str.title()

In [21]:
df7.to_csv('cost_living.csv')

In [22]:
df7.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 612 entries, 0 to 611
Data columns (total 4 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Unnamed: 0         612 non-null    int64
 1   countries          612 non-null    object
 2   cost_living_index  612 non-null    float64
 3   year               612 non-null    int64
dtypes: float64(1), int64(2), object(1)
memory usage: 19.2+ KB